---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameterSet.IsEmpty
source: html/ea865c92-46ef-6938-e24e-8e87d230aa25.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.